# What is pandas?

## Overview

### Objectives

+ Know why pandas is suitable for data analysis in Python
+ Identify a DataFrame as 

### Resources

+ [Official Documentation](http://pandas.pydata.org/pandas-docs/stable/)
+ [Package Overview](http://pandas.pydata.org/pandas-docs/stable/overview.html)
+ [Intro to Data Structures](http://pandas.pydata.org/pandas-docs/stable/dsintro.html)

## Welcome to ....
![][1]


### What is pandas?
pandas is one of the most popular open source data exploration libraries currently available. It gives its users the power to explore, manipulate, query, aggregate, and visualize **tabular** data. Tabular meaning data that is two-dimensional with rows and columns; i.e. a table.

### Why pandas and not xyz?
In this current age of data explosion, there are now many dozens of other tools that have many of the same capabilities as the pandas library. However, there are many aspects of pandas that make it an attractive choice for data analysis and it continues to have one of the fastest growing user bases.

* It's a Python library and integrates well with the other popular data science libraries such as numpy, scikit-learn, statsmodels, matplotlib and seaborn.
* It is nearly self-contained in that lots of functionality is built into one package. This contrasts with R, where many packages are needed to obtain the same functionality.
* The community is excellent. Looking at Stack Overflow, for example, there are [many ten's of thousands of][2] pandas questions. If you need help, you are nearly guaranteed to find it very quickly. 

### Why is it named after an East Asian bear?

The pandas library was begun by Wes McKinney beginning in 2008 at a hedge fund named AQR. Finance speak is to call tabular data 'panel data' which smashed together becomes pandas. If you are really interested in the history, you can hear it from the creator [himself][3].

### Python already has data structures to handle data, why do we need another one?

Even though Python is a high-level language, its primary built-in data structures lists and dictionaries, do not easily lend themselves to tabular data analysis in ways that humans can operate on them. 

### pandas is built directly on numpy

[numpy][4] ('numerical Python') is the most popular third-party Python library for scientific computing and forms the foundation for dozens of others, including pandas. numpy's primary data structure is an n-dimensional array which is much more powerful than a Python list and with much better performance.

All of the data in pandas is stored in numpy arrays. That said, it isn't necessary to know much about numpy when learning pandas. You can think of pandas as a higher-level, easier to use interface for doing data analysis than numpy. It is a good idea to eventually learn numpy, but for most tasks, pandas will be the right tool.

### numpy tutorial in appendix

Although it is not necessary to understand numpy to perform data analysis with pandas, it is a major piece of the data science ecosystem in Python and it can be used alongside pandas. A thorough numpy tutorial is available in Appendix A.

## pandas operates on tabular (table) data

There are numerous formats for data such as XML, JSON, raw bytes, and many others. But, for our purposes, we will only be examining what most people think of when they think of data - a table. pandas is built just for analyzing this tabular, rectangular, very deceptively normal concept of data. pandas has the capability to read in many different formats of data, but they all will be converted to tabular data.

### The DataFrame and Series

The DataFrame and Series are the two primary pandas objects that we will be using throughout this course.

* **DataFrame** - A two-dimensional data structure that looks like any other rectangular table of data you have seen with rows and columns.
* **Series** - A single dimension of data. It is analogous to a single column of data or a one dimensional array.

[1]: images/pandas_logo.png
[2]: http://stackoverflow.com/questions/tagged/pandas
[3]: https://www.youtube.com/watch?v=kHdkFyGCxiY
[4]: http://www.numpy.org/

## pandas examples

The rest of this chapter is dedicated to showing examples of what pandas is capable of doing. There will be one or two examples from each of the following major areas of the library.

* Reading data
* Filtering data
* Aggregating methods
* Non-Aggregating methods
* Aggregating within groups
* Tidying data
* Joining data
* Time series analysis
* Visualization

The goal is to give you a broad overview of what pandas is capable of doing. You are not expected to understand the syntax but rather get a few ideas of what you can expect to accomplish when using pandas. Explanations will be brief, but hopefully will provide just enough information so that you can logically follow what the end result is.

### The `head` method

You will notice that many of the last lines of code end with the `head` method. This returns, by default, the first five rows. This helps keep the output compact.

## Reading data
There will be multiple datasets used during the rest of this chapter. pandas can read in a variety of different data formats. The `read_csv` function is able to read in text data that is separated by a delimiter. By default, the delimiter is a comma. Below, we read in public bike usage data from the city of Chicago.

In [1]:
import pandas as pd
bikes = pd.read_csv('../data/bikes.csv')
bikes.head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
0,7147,Subscriber,Male,2013-06-28 19:01:00,2013-06-28 19:17:00,993,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,Michigan Ave & Oak St,41.900960,-87.623777,15.0,73.9,10.0,12.7,-9999.0,mostlycloudy
1,7524,Subscriber,Male,2013-06-28 22:53:00,2013-06-28 23:03:00,623,Clinton St & Washington Blvd,41.883380,-87.641170,31.0,Wells St & Walton St,41.899930,-87.634430,19.0,69.1,10.0,6.9,-9999.0,partlycloudy
2,10927,Subscriber,Male,2013-06-30 14:43:00,2013-06-30 15:01:00,1040,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,Dearborn St & Monroe St,41.881320,-87.629521,23.0,73.0,10.0,16.1,-9999.0,mostlycloudy
3,12907,Subscriber,Male,2013-07-01 10:05:00,2013-07-01 10:16:00,667,Carpenter St & Huron St,41.894556,-87.653449,19.0,Clark St & Randolph St,41.884576,-87.631890,31.0,72.0,10.0,16.1,-9999.0,mostlycloudy
4,13168,Subscriber,Male,2013-07-01 11:16:00,2013-07-01 11:18:00,130,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,Damen Ave & Pierce Ave,41.909396,-87.677692,19.0,73.0,10.0,17.3,-9999.0,partlycloudy

pandas stores its data in a **DataFrame** which is the topic of the next chapter.

## Filtering data
pandas can filter the rows of a DataFrame based on whether the values in that row meet a condition. For instance, we can select only the rides that had a `tripduration` greater than 5000 (seconds). This example is a single condition that gets tested for each row. Only the rows that meet this condition are returned.

### Single Condition

In [107]:
filt = bikes['tripduration'] > 5000
bikes[filt].head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
18,40924,Subscriber,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,41.878114,-87.639971,35.0,Millennium Park,41.881032,-87.624084,35.0,79.0,10.0,13.8,0.0,cloudy
40,61401,Subscriber,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,41.867173,-87.625955,19.0,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,87.1,10.0,8.1,-9999.0,partlycloudy
77,87005,Subscriber,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,41.856594,-87.627542,15.0,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,82.9,10.0,5.8,-9999.0,mostlycloudy
335,323274,Subscriber,Male,2013-08-25 17:20:00,2013-08-25 19:26:00,7533,McClurg Ct & Illinois St,41.891020,-87.617300,23.0,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,87.1,10.0,12.7,-9999.0,clear
504,442585,Subscriber,Male,2013-09-08 03:43:00,2013-09-08 07:20:00,13037,Dearborn Pkwy & Delaware Pl,41.899007,-87.629928,19.0,Sheridan Rd & Irving Park Rd,41.954340,-87.654601,11.0,71.6,10.0,11.5,-9999.0,cloudy

### Multiple Conditions

We can test for multiple conditions in a single row. The following example only returns riders that are female **and** have a `tripduration` greater than 5000.

In [108]:
filt1 = bikes['tripduration'] > 5000
filt2 = bikes['gender'] == 'Female'
filt = filt1 & filt2
bikes[filt].head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
40,61401,Subscriber,Female,2013-07-14 14:08:00,2013-07-14 15:53:00,6274,Wabash Ave & Roosevelt Rd,41.867173,-87.625955,19.0,Lake Shore Dr & Monroe St,41.881050,-87.616970,11.0,87.1,10.0,8.1,-9999.0,partlycloudy
77,87005,Subscriber,Female,2013-07-21 11:35:00,2013-07-21 13:54:00,8299,State St & 19th St,41.856594,-87.627542,15.0,Sheffield Ave & Kingsbury St,41.909592,-87.653497,15.0,82.9,10.0,5.8,-9999.0,mostlycloudy
1954,1103416,Subscriber,Female,2013-12-28 11:37:00,2013-12-28 13:34:00,7050,LaSalle St & Washington St,41.882664,-87.632530,15.0,Theater on the Lake,41.926277,-87.630834,15.0,44.1,10.0,12.7,-9999.0,clear
2712,1416670,Subscriber,Female,2014-04-15 15:56:00,2014-04-16 14:09:00,79988,Clinton St & Washington Blvd,41.883380,-87.641170,31.0,May St & Taylor St,41.869482,-87.655486,15.0,35.1,10.0,6.9,-9999.0,cloudy
2915,1499497,Subscriber,Female,2014-04-25 13:01:00,2014-04-25 16:27:00,12351,May St & Taylor St,41.869482,-87.655486,15.0,Halsted St & Polk St,41.871840,-87.646640,19.0,66.0,10.0,12.7,-9999.0,partlycloudy

The next example has multiple conditions but only requires that one of the conditions is true. It returns all the rows where either the rider is female or the `tripduration` is greater than 5000.

In [109]:
filt = filt1 | filt2
bikes[filt].head()

,trip_id,usertype,gender,starttime,stoptime,tripduration,from_station_name,latitude_start,longitude_start,dpcapacity_start,to_station_name,latitude_end,longitude_end,dpcapacity_end,temperature,visibility,wind_speed,precipitation,events
9,23558,Subscriber,Female,2013-07-04 15:00:00,2013-07-04 15:16:00,922,Lakeview Ave & Fullerton Pkwy,41.925858,-87.638973,19.0,Racine Ave & Congress Pkwy,41.874640,-87.657030,19.0,81.0,10.0,12.7,-9999.0,mostlycloudy
14,31121,Subscriber,Female,2013-07-06 12:39:00,2013-07-06 12:49:00,610,Morgan St & Lake St,41.885483,-87.652305,15.0,Aberdeen St & Jackson Blvd,41.877726,-87.654787,15.0,82.0,10.0,5.8,-9999.0,mostlycloudy
18,40924,Subscriber,Male,2013-07-09 13:12:00,2013-07-09 14:42:00,5396,Canal St & Jackson Blvd,41.878114,-87.639971,35.0,Millennium Park,41.881032,-87.624084,35.0,79.0,10.0,13.8,0.0,cloudy
20,42488,Subscriber,Female,2013-07-09 17:39:00,2013-07-09 17:55:00,943,State St & Van Buren St,41.877181,-87.627844,27.0,State St & 16th St,41.860121,-87.627729,15.0,82.9,10.0,9.2,-9999.0,mostlycloudy
21,42818,Subscriber,Female,2013-07-09 19:26:00,2013-07-09 19:38:00,726,Clark St & Randolph St,41.884576,-87.631890,31.0,State St & Harrison St,41.873958,-87.627739,19.0,82.9,10.0,9.2,-9999.0,partlycloudy

## Aggregating methods

The technical definition of an **aggregation** is when a sequence of values is summarized by a **single** number. For example sum, mean, median, min, and mix are all examples of aggregation functions. By default, calling these methods on a pandas DataFrame will apply the aggregation to each column. Below, we are using a dataset containing the percentage of undergraduate races for all US colleges.

In [110]:
college = pd.read_csv('../data/college.csv', index_col='instnm')
college.head()

,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,ugds,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
instnm,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [111]:
cr = college.loc[:,'ugds_white':'ugds_unkn']
cr.head()
# cr = college[:]['ugds_white':'ugds_unkn'] .... error

,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
instnm,,,,,,,,,
Alabama A & M University,0.0333,0.9353,0.0055,0.0019,0.0024,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,0.0022,0.0007,0.0368,0.0179,0.0100
Amridge University,0.2990,0.4192,0.0069,0.0034,0.0000,0.0000,0.0000,0.0000,0.2715
University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,0.0143,0.0002,0.0172,0.0332,0.0350
Alabama State University,0.0158,0.9208,0.0121,0.0019,0.0010,0.0006,0.0098,0.0243,0.0137

The `mean` method takes the mean of each column.

In [112]:
cr.mean()

ugds_white    0.510207
ugds_black    0.189997
ugds_hisp     0.161635
ugds_asian    0.033544
ugds_aian     0.013813
ugds_nhpi     0.004569
ugds_2mor     0.023950
ugds_nra      0.016086
ugds_unkn     0.045181
dtype: float64

pandas allows you to aggregate rows as well. You must use the `axis` parameter to change the direction of the aggregation.

In [113]:
cr.sum(axis=1).head()

instnm
Alabama A & M University               1.0000
University of Alabama at Birmingham    0.9999
Amridge University                     1.0000
University of Alabama in Huntsville    1.0000
Alabama State University               1.0000
dtype: float64

In [114]:
cr.sum().head()

ugds_white    3507.1643
ugds_black    1306.0369
ugds_hisp     1111.0782
ugds_asian     230.5831
ugds_aian       94.9476
dtype: float64

## Non-aggregating methods

There are methods that perform some calculation on the DataFrame that do not aggregate the data. They preserve the shape of the DataFrame. For example, the `round` method will round each number to a particular decimal place.

In [115]:
cr.round(2).head()

,ugds_white,ugds_black,ugds_hisp,ugds_asian,ugds_aian,ugds_nhpi,ugds_2mor,ugds_nra,ugds_unkn
instnm,,,,,,,,,
Alabama A & M University,0.03,0.94,0.01,0.00,0.00,0.0,0.00,0.01,0.01
University of Alabama at Birmingham,0.59,0.26,0.03,0.05,0.00,0.0,0.04,0.02,0.01
Amridge University,0.30,0.42,0.01,0.00,0.00,0.0,0.00,0.00,0.27
University of Alabama in Huntsville,0.70,0.13,0.04,0.04,0.01,0.0,0.02,0.03,0.04
Alabama State University,0.02,0.92,0.01,0.00,0.00,0.0,0.01,0.02,0.01

## Aggregating within groups

Above, we performed an aggregation on the entire DataFrame. We can instead, perform aggregations within groups of the data. Below we use an insurance dataset.

In [116]:
ins = pd.read_csv('../data/insurance.csv')
ins.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

One of the simplest aggregations is count the frequency of occurrence of all the unique values within a single column. This is performed below with the `value_counts` method.

### Count frequency of one column

In [118]:
ins['region'].value_counts()

southeast    364
northwest    325
southwest    325
northeast    324
Name: region, dtype: int64

Let's say we wish to find the mean changes for each of the unique values found in the `sex` column. The `groupby` method gives us this functionality.

In [119]:
ins.groupby('sex').agg({'charges': 'mean'}).round(3)

          charges
sex
female  12569.579
male    13956.751

In [120]:
ins.groupby('sex').agg({'charges': 'mean'}).round(-3)

        charges
sex
female  13000.0
male    14000.0

### Multiple aggregation functions

pandas allows us to perform multiple aggregations at the same time. Below, we find the mean, count the number of non-missing values, and the max of the `charges` column by each unique `sex`.

In [94]:
ins.groupby('sex').agg({'charges': ['mean', 'count', 'max']}).round(0)

        charges
           mean count      max
sex
female  12570.0   662  63770.0
male    13957.0   676  62593.0

### Multiple Grouping columns

pandas allows us form groups based on multiple columns. In the below example, each unique combination of `sex` and `region` for a group. There are 8 unique groups and for each of these groups the same aggregations as above are performed on the `charges` column.

In [95]:
ins.groupby(['sex', 'region']).agg({'charges': ['mean', 'count', 'max']}).round(0)

                  charges
                     mean count      max
sex    region
female northeast  12953.0   161  58571.0
       northwest  12480.0   164  55135.0
       southeast  13500.0   175  63770.0
       southwest  11274.0   162  48824.0
male   northeast  13854.0   163  48549.0
       northwest  12354.0   161  60021.0
       southeast  15880.0   189  62593.0
       southwest  13413.0   163  52591.0

### Pivot Tables
We can reproduce the exact same output as above in a different shape with the `pivot_table` method. It groups and aggregates the same as `groupby` but places the unique values of one of the grouping columns as the new columns in the resulting DataFrame. Notice that pivot tables make for easier comparisons across groups.

In [62]:
pt = ins.pivot_table(index='sex', columns='region', 
                     values='charges', aggfunc='mean').round(0)
pt

region  northeast  northwest  southeast  southwest
sex
female    12953.0    12480.0    13500.0    11274.0
male      13854.0    12354.0    15880.0    13413.0

### Styling DataFrames

To help make your data really pop-out, pandas provides ways to style your DataFrame in various ways. Below, the maximum value of each column is highlighted.

In [63]:
pt.style.highlight_max()

## Tidying

Many datasets will be messy upon first inspection and pandas provides ways to clean them so that they are put into 'tidy' form.

### Options in the `read_csv` function

Below, we read in a new dataset on plane crashes. Notice all the question marks. They represent missing values, but by default pandas will read them in as strings.

In [96]:
pc = pd.read_csv('../data/tidy/planecrashinfo.csv')
pc.head(3)

,date,time,location,operator,flight_no,route,ac_type,registration,cn_ln,aboard,fatalities,ground,summary
0,"September 17, 1908",17:18,"Fort Myer, Virginia",Military - U.S. Army,?,Demonstration,Wright Flyer III,?,1,2 Â (passengers:1Â crew:1),1 Â (passengers:1Â crew:0),0,"During a demonstration flight, a U.S. Army fly..."
1,"September 07, 1909",?,"Juvisy-sur-Orge, France",?,?,Air show,Wright Byplane,SC1,?,1 Â (passengers:0Â crew:1),1 Â (passengers:0Â crew:0),0,Eugene Lefebvre was the first pilot to ever be...
2,"July 12, 1912",06:30,"Atlantic City, New Jersey",Military - U.S. Navy,?,Test flight,Dirigible,?,?,5 Â (passengers:0Â crew:5),5 Â (passengers:0Â crew:5),0,First U.S. dirigible Akron exploded just offsh...

The `read_csv` has dozens of options to help read in messy data. Of the options allows you to convert a particular string to missing values. Notice that all of the question marks are now `NaN` (not a number).

In [87]:
pc = pd.read_csv('../data/tidy/planecrashinfo.csv', na_values='?')
pc.head(3)

,date,time,location,operator,flight_no,route,ac_type,registration,cn_ln,aboard,fatalities,ground,summary
0,"September 17, 1908",17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2 Â (passengers:1Â crew:1),1 Â (passengers:1Â crew:0),0.0,"During a demonstration flight, a U.S. Army fly..."
1,"September 07, 1909",NaN,"Juvisy-sur-Orge, France",NaN,NaN,Air show,Wright Byplane,SC1,NaN,1 Â (passengers:0Â crew:1),1 Â (passengers:0Â crew:0),0.0,Eugene Lefebvre was the first pilot to ever be...
2,"July 12, 1912",06:30,"Atlantic City, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5 Â (passengers:0Â crew:5),5 Â (passengers:0Â crew:5),0.0,First U.S. dirigible Akron exploded just offsh...

### String manipulation

Often times there is data stuck within a string column that you will need to extract. The `aboard` column appears to have three distinct pieces of information; the total number of people on board, the number of passengers, and the number of crew.

In [97]:
aboard = pc['aboard']
aboard.head()

0     2 Â  (passengers:1Â  crew:1)
1     1 Â  (passengers:0Â  crew:1)
2     5 Â  (passengers:0Â  crew:5)
3     1 Â  (passengers:0Â  crew:1)
4    20 Â  (passengers:?Â  crew:?)
Name: aboard, dtype: object

pandas has special functionality for manipulating strings. Below, we use a regular expression to extract the pertinent numbers from the `aboard` column.

In [98]:
aboard.str.extract(r'(\d+)?\D*(\d+)?\D*(\d+)?').head()

    0    1    2
0   2    1    1
1   1    0    1
2   5    0    5
3   1    0    1
4  20  NaN  NaN

### Reshaping into tidy form

Occasionally, you will have several columns of data that all belong in a single column. Take a look at the DataFrame below on average arrival delay of airlines at different airports. All the columns with three-letter airport codes could be placed in the same column as they all contain the arrival delay which has the same units.

In [99]:
aad = pd.read_csv('../data/tidy/average_arrival_delay.csv').head()
aad

  airline  ATL   DEN   DFW   IAH   LAS  LAX   MSP   ORD   PHX  SFO
0      AA  4.0   9.0   5.0  11.0   8.0  3.0   1.0   8.0   5.0  3.0
1      AS  6.0  -3.0  -5.0   1.0   2.0 -3.0   6.0   2.0  -9.0  4.0
2      B6  NaN  12.0   4.0   NaN  11.0  2.0   NaN  23.0  20.0  5.0
3      DL  0.0  -3.0  10.0   3.0  -3.0  3.0  -1.0   7.0  -4.0  0.0
4      EV  7.0  14.0  10.0   3.0   NaN  NaN  10.0   8.0 -14.0  NaN

The `melt` method stacks columns one on top of the other. Here, it places all of the three-letter airport code columns into a single column. The first two airports (ATL and DEN) are shown below in the new tidy DataFrame.

In [93]:
#from relational table to Columnar table
aad.melt(id_vars='airline', var_name='airport', value_name='delay').head()

  airline airport  delay
0      AA     ATL    4.0
1      AS     ATL    6.0
2      B6     ATL    NaN
3      DL     ATL    0.0
4      EV     ATL    7.0

## Joining Data
pandas can join multiple DataFrames together by matching values in one or more columns. If you are familiar with SQL, then pandas performs joins in a similar fashion. Below, we make a connection to a database and read in two of its tables.

In [100]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///../data/neurIPS.db')

authors = pd.read_sql('Authors', engine)
pa = pd.read_sql('PaperAuthors', engine)

ImportError: No module named sqlalchemy

Output the first 5 rows of each DataFrame.

In [86]:
authors.head()

NameError: name 'authors' is not defined

In [ ]:
pa.head()

We can now join these tables together using the `merge` method. The `AuthorID` column from the `pa` table is aligned with the `Id` column of the `authors` table.

In [ ]:
pa.merge(authors, how='left', left_on='AuthorId', right_on='Id').head()

## Time Series Analysis

One of the original purposes of pandas was to do time series analysis. Below, we read in the last 5 years of Apple's stock price data with help from the excellent [IEX Trading API][0].

[0]: https://iextrading.com/developer/docs/

In [101]:
aapl = pd.read_json('https://api.iextrading.com/1.0/stock/aapl/chart/5y')
aapl = aapl.set_index('date')
aapl.head()

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2014-05-13,0.121767,0.000000,0.157,77.7421,77.8443,"May 13, 14",77.3415,77.5117,5704942,39934594,77.7850
2014-05-14,0.014404,0.000185,0.019,77.7565,78.2187,"May 14, 14",77.4777,77.5680,5942978,41600846,77.9909
2014-05-15,-0.661206,-0.008320,-0.850,77.0953,78.1140,"May 15, 14",76.9932,77.8652,8244533,57711731,77.4477
2014-05-16,1.137800,0.006316,1.476,78.2331,78.2358,"May 16, 14",76.6475,77.0705,9870262,69091834,77.4089
2014-05-19,0.926995,0.018240,1.185,79.1601,79.5189,"May 19, 14",78.2096,78.2777,11348432,79439024,79.1532

### Select a period of time

pandas allows us to easily select a period of time. Below, we select all of the trading data from February 20, 2018 through March 5, 2018.

In [102]:
aapl['2018-02-20':'2018-03-05']

,change,changeOverTime,changePercent,close,high,label,low,open,unadjustedVolume,volume,vwap
date,,,,,,,,,,,
2018-02-20,-0.569109,1.169006,-0.336,168.6231,170.9878,"Feb 20, 18",168.2012,168.8193,33930540,33930540,169.7012
2018-02-21,-0.765354,1.159161,-0.454,167.8577,170.8505,"Feb 21, 18",167.7988,169.5847,37471623,37471623,169.7221
2018-02-22,1.403100,1.177210,0.836,169.2609,170.6836,"Feb 22, 18",168.4857,168.5740,30991940,30991940,169.6911
2018-02-23,2.943700,1.215074,1.739,172.2045,172.3517,"Feb 23, 18",170.2813,170.4089,33812360,33812360,171.3788
2018-02-26,3.404800,1.258871,1.977,175.6094,176.0215,"Feb 26, 18",172.9012,173.0386,38162174,38162174,175.0221
2018-02-27,-0.569108,1.251551,-0.324,175.0403,177.0910,"Feb 27, 18",174.8146,175.7369,38928125,38928125,175.9270
2018-02-28,-0.264930,1.248142,-0.151,174.7753,177.2235,"Feb 28, 18",174.7067,175.8939,37782138,37782138,175.9874
2018-03-01,-3.061400,1.208763,-1.752,171.7139,176.3993,"Mar 1, 18",169.4179,175.1875,48801970,48801970,172.7824
2018-03-02,1.187300,1.224036,0.691,172.9012,172.9895,"Mar 2, 18",169.2118,169.5552,38453950,38453950,171.4862
2018-03-05,0.598545,1.231735,0.346,173.4998,174.4025,"Mar 5, 18",171.2429,171.9200,28401366,28401366,173.2066

### Group by time

We can group by some length of time. Here, we group together every month of trading data and return the average closing price of that month.

In [103]:
aapl_mc = aapl.resample('M').agg({'close':'mean'})
aapl_mc.head()

                close
date
2014-05-31  79.858269
2014-06-30  84.215200
2014-07-31  87.643109
2014-08-31  90.585329
2014-09-30  92.613495

## Visualization

pandas provides basic visualization abilities by giving its users a few nice default plots. Below, we plot the average monthly closing price of Apple for the last 5 years.

In [104]:
%matplotlib inline
aapl_mc.plot(kind='line', figsize=(10, 4))

ImportError: No module named matplotlib

Here, we use the college race data to create a box plot of each of the race percentage columns.

In [105]:
cr.plot(kind='box', figsize=(12, 4))

ImportError: matplotlib is required for plotting.

We turn our pivot table from above into a bar graph.

In [106]:
pt.plot(kind='bar', figsize=(10, 4))

ImportError: matplotlib is required for plotting.

## Much More

The above was just a small sampling that pandas has to offer, but does show many basic examples from many of the major sections of the library.